In [1]:
import pandas as pd
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Tom'],
    'Age': [25, 30, 35, 40, 45, 30],
    'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago', 'Seattle', 'New York'],
    'Salary': [60000, 65000, 70000, 75000, 80000, 90000],
}
df = pd.DataFrame(data)
df = (df.sort_values(by='City', ascending=False))

In [2]:
df = (df.sort_values(by='City', ascending=False))
df

      Name  Age           City  Salary
4      Eve   45        Seattle   80000
1      Bob   30  San Francisco   65000
0    Alice   25       New York   60000
5      Tom   30       New York   90000
2  Charlie   35    Los Angeles   70000
3    David   40        Chicago   75000

In [3]:
df = df.groupby("City")["Salary"].mean()
df

City
Chicago          75000.0
Los Angeles      70000.0
New York         75000.0
San Francisco    65000.0
Seattle          80000.0
Name: Salary, dtype: float64